<!--
 * @Date: 2023-09-01 12:21:17
 * @LastEditors: Gemini2035 76091679+Gemini2035@users.noreply.github.com
 * @LastEditTime: 2023-09-01 12:38:25
 * @FilePath: /business-website/src/components/tips/text-area.vue
-->
<script lang="ts" setup></script>

<template>
    <div class="booknotes-content">
        <div class="notes-item">
            <h1>1.旅客注意事项</h1>
            <h2>1.1 不宜乘机人群</h2>
            <h3>1.1.1 重症病人</h3>
            <div>
                a.
                心血管疾病患者、脑血管病、呼吸系统疾病患者，严重贫血的病人，耳鼻疾病患者，有大面积外伤的旅客，不宜乘飞机。
            </div>
            <div>b. 做过胃肠手术的病人，一般在手术十天内不能乘坐飞机。</div>
            <div>c. 消化道出血病人要在出血停止三周后才能乘飞机。</div>
            <div>
                d.
                传染性疾病患者，在国家规定的隔离期内，不能乘坐飞机。其中水痘病人在损害部位未痊愈，不能乘飞机。
            </div>
        </div>
        <div class="notes-item">
            <h1>2. 航班与价格</h1>
            <h2>2.1 航班</h2>
            <div>
                您选择条件后的所列航班为符合条件的全部航班，订位如有问题会另行电话联系。
            </div>
            <h2>2.2 价格</h2>
            <div>
                价格由票价、税金、燃油费、民航发展基金（原机场建设费）四部分组成。
            </div>
        </div>
        <div class="notes-item">
            <h1>3. 订票注意事项</h1>
            <h2>3.1 旅客基本信息</h2>
            <h3>
                3.1.1
                姓名及证件：必须用登机人本人姓名和证件提交订单，如预订姓名与证件姓名不一致将无法登机，所造成的损失由预订人自行承担。
            </h3>
            <h3>
                3.1.2
                联系方式：请正确、详细的输入各位乘机人联系信息及您的联系信息并保持通讯畅通，以便机票预订员能直接与您联系，并将航班动态信息告知各位乘机人；如联系人、联系电话等资料有误，此订单将被视为无效订单作取消处理；如乘机人联系信息有误而导致航班动态信息未告知乘机人，凯行不承担相关责任。
            </h3>
            <h2>3.2 旅客类型选择</h2>
            <div>
                选择乘机人相应的身份,系统将根据您所提供的身份为您提供相应价格。无论您的身份是留学生、新移民、劳务人员或是儿童,只要您愿意接受
                “普通”乘客类型的价格,也可以预订此价格。
            </div>
        </div>
        <div class="notes-item">
            <h1>4. 预订与出票</h1>
            <h2>4.1 确认</h2>
            <h3>4.1.1确认方式有email确认和手机短信确认。</h3>
            <h3>
                4.1.2
                凯行将按照您选择的确认方式与您确认所预订的航班、价格及配送等问题。
            </h3>
            <h3>
                4.1.3电话和邮箱请务必正确，保持畅通，如果订位不成功凯行将会尽快电话联系告知，如所留的通讯方式无人接听、忙音等任何通讯问题而无法联系到  预订人，从而导致不能及时确认、出票等问题凯行将不承担责任。
            </h3>
            <h2>4.2 重复订单</h2>
            <div>
                请勿提交重复订单（同一位登机人相同时间段两张以上的机票订单），如提交重复订单导致了重复出票，所产生的退票损失将由预订人全部承担。
            </div>
        </div>
        <div class="notes-item">
            <h1>5. 更改与退票</h1>
            <div>必须按照顺序使用机票。</div>
            <h2>5.1 退票</h2>
            <h3>
                5.1.1
                客票全部未使用:根据各航空公司规定执行退票，有的价格可以退票，有的价格出票后不允许退票。
            </h3>
        </div>
        <div class="notes-item">
            <h1>6. 登机时间</h1>
            <div>
                国内航班一般提前1—2小时到达机场办理登机手续，航班起飞前45分钟停止办理；国际航班一般须提前2－3小时到达机场办理登机手续，航班起飞前1小时停止办理。（注：具体每个航空公司办理登机
            </div>
        </div>
        <div class="notes-item">
            <h1>7. 机位再确认</h1>
            <h2>7.1 什么是机位再确认</h2>
            <div>
                已经订妥国际联程或回程机位，如在上机地点停留72小时以上，应在航班起飞前72小时对所订座位予与再证实，否则原订座位将被自行取消。
            </div>
            <h1>8. 机票使用原则</h1>
            <h1>9. 特殊餐食及服务申请</h1>
            <h1>10. 航班数据及机型调整</h1>
            <h1>11. 里程积累规则</h1>
            <h1>12. 管辖法院</h1>
        </div>
    </div>
</template>

<style lang="scss" scoped>
.booknotes-content {
    width: 90%;
    margin: 0 auto;

    .notes-item {
        margin-bottom: 20px;
        font-size: 14px;

        h1 {
            margin-top: 30px;
            font-size: 20px;
            font-weight: 400;
        }

        h2 {
            font-size: 16px;
            font-weight: 400;
            margin-top: 30px;
        }

        h3 {
            font-size: 14px;
            font-weight: 400;
        }
    }
}
</style>